costinm/dmesh/fw/esp32/rust/sdkconfig.defaults
# Rust ESP-IDF application defaults. Keep this small; the C firmware remains
# the source of truth while components are translated incrementally.

CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# CONFIG_XTAL_FREQ_26 is not set
# CONFIG_XTAL_FREQ_40 is not set
CONFIG_XTAL_FREQ_AUTO=y
# CONFIG_ESP32_XTAL_FREQ_26 is not set
# CONFIG_ESP32_XTAL_FREQ_40 is not set
CONFIG_ESP32_XTAL_FREQ_AUTO=y
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# Main performs NVS/settings, bounded stream setup, and ESP-PM configuration
# before handing off to its cooperative loop. The prior 7 KiB stack overflows
# on classic ESP32 during PM setup; use an explicit 12 KiB bound rather than
# permitting silent stack corruption.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_0=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
# CONFIG_CONSOLE_UART_DEFAULT is not set
CONFIG_CONSOLE_UART_CUSTOM=y
CONFIG_CONSOLE_UART_CUSTOM_NUM_0=y
CONFIG_CONSOLE_UART_NUM=0
CONFIG_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESPTOOLPY_BAUD_460800B=y
CONFIG_ESPTOOLPY_BAUD=460800
# Main deliberately installs Recovery and the second-stage/partition-table
# images.  Permit those dangerous-region writes; the Recovery command still
# rejects the running Main target and validates the explicit target/range.
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED=y
CONFIG_MONITOR_BAUD=115200

# Main receives the same 4 KiB DRS2 frames as Recovery.  Let TCP pipeline
# several frames without adding an application-level ACK for each one.
CONFIG_LWIP_TCP_WND_DEFAULT=23040
# The flash module sets the socket receive buffer explicitly. Enable the lwIP
# socket option and run TCP timers more frequently so delayed ACK/retransmit
# handling does not add the default 250 ms cadence to a short transfer.
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCP_TMR_INTERVAL=20

CONFIG_PM_ENABLE=y
CONFIG_PM_LIGHT_SLEEP_CALLBACKS=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# Match the C build's IRAM tradeoff so the full mesh feature set has room on
# classic ESP32 as Rust modules are added.
# CONFIG_ESP_WIFI_IRAM_OPT is not set
# CONFIG_ESP_WIFI_RX_IRAM_OPT is not set
# CONFIG_SPI_MASTER_ISR_IN_IRAM is not set
# CONFIG_SPI_SLAVE_ISR_IN_IRAM is not set
# CONFIG_ESP_SPI_BUS_LOCK_ISR_FUNCS_IN_IRAM is not set

# BLE is needed for companion pairing, command GATT, and raw advertising hints.
# Use NimBLE instead of Bluedroid; the GATT surface is intentionally small and
# NimBLE behaves better on S3 during pairing-advertising bring-up.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
# CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY is not set
# CONFIG_BTDM_CTRL_MODE_BTDM is not set
# CONFIG_BT_BLUEDROID_ENABLED is not set
# CONFIG_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_GAP_SERVICE=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
# The SDK6 NimBLE configuration does not provide the complete TinyCrypt CMAC
# type when SMP is enabled. Use the supported mbedTLS backend for bonded
# GATT/CoC links instead.
CONFIG_BT_NIMBLE_CRYPTO_STACK_MBEDTLS=y
CONFIG_BT_SMP_CRYPTO_STACK_MBEDTLS=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CCCDS=8
# Prefer a BLE link that permits the peripheral to miss three 1-second
# connection events while raw-NAN keeps its 4-second cadence.  The ESP applies
# the same values after either a GATT or CoC connection; Android remains free
# to negotiate a stricter value if its controller cannot accept this profile.
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MIN_CONN_INTERVAL=800
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MAX_CONN_INTERVAL=800
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SLAVE_LATENCY=3
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SUPERVISION_TMO=3000
# Keep one LE Credit-Based Connection-Oriented Channel available for the
# explicitly requested Android CoC lab probe.  It is idle unless
# `ble coc=true` is sent; the probe uses a dynamic PSM, not IPSP's reserved
# PSM, and does not turn the firmware into an IPv6-over-BLE implementation.
CONFIG_BT_NIMBLE_L2CAP_COC_MAX_NUM=1
# The classic ESP32 companion path is a single legacy peripheral.  Do not
# enable BLE 5 / extended-advertising controller features until basic Android
# ATT discovery and notification exchange are proven on hardware.
# CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT is not set
# CONFIG_BT_NIMBLE_EXT_ADV is not set
# Keep the NimBLE host on the classic ESP32 controller/HCI core for the
# initial Android ATT validation.  Moving the host to APP CPU left a connected
# link unable to service discovery on lora2.
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
# CONFIG_BT_NIMBLE_PINNED_TO_CORE_1 is not set
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# Keep the NimBLE GAP/GATT event path in IRAM while validating Android GATT.
# This must remain off until a connected peripheral is proven on the lab boards.
# CONFIG_BT_NIMBLE_LOW_SPEED_MODE is not set

# Disable unused default NimBLE services to save code space.
# The firmware uses its own custom GATT service via native/dmesh_nimble/.
CONFIG_BT_NIMBLE_PROX_SERVICE=n
CONFIG_BT_NIMBLE_ANS_SERVICE=n
CONFIG_BT_NIMBLE_CTS_SERVICE=n
CONFIG_BT_NIMBLE_HTP_SERVICE=n
CONFIG_BT_NIMBLE_IPSS_SERVICE=n
CONFIG_BT_NIMBLE_TPS_SERVICE=n
CONFIG_BT_NIMBLE_IAS_SERVICE=n
CONFIG_BT_NIMBLE_LLS_SERVICE=n
CONFIG_BT_NIMBLE_SPS_SERVICE=n
CONFIG_BT_NIMBLE_HR_SERVICE=n

# The current classic ESP32 lab boards have no external 32.768 kHz RTC clock.
# ESP-IDF permits Bluetooth modem sleep with the main XTAL, but not system
# light sleep; keep controller modem sleep disabled so the firmware's raw-NAN
# light-sleep mode remains available. A board with an external RTC clock may
# enable and qualify Bluetooth modem sleep separately.
# CONFIG_BTDM_CTRL_MODEM_SLEEP is not set
